TKW/config/ITK_111/messages_for_validation/to_be_validated_1554712504048.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--This example message is provided for illustrative purposes only. It has had no clinical validation. Whilst every effort has been taken to ensure that the examples are consistent with the message specification contained within the MiM, where there are conflicts with the written message specification or schema, the specification or schema shall be considered to take precedence-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:SendNHS111Report-v2-0</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<wsa:From>
			<wsa:Address>http://localhost:4000</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
<itk:DistributionEnvelope xmlns:itk="urn:nhs-itk:ns:201005" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<!-- the header of the distribution envelope contains a service name - ALWAYS "SendNHS111Report-v1-0" for NHS 111 CDA documents and a generated DCE UUID trackingId-->
	<itk:header service="urn:nhs-itk:services:201005:SendNHS111Report-v2-0" trackingid="7D6F23E0-AE1A-11DB-9808-B18E1E0994CD">
		<!-- the address list is not needed, as the end point has been looked up and is in the SOAP header 
		<itk:addresslist>
			<itk:address uri="urn:nhs-uk:addressing:ods:EM396"/>
		</itk:addresslist> -->
		<!-- an audit identification of the sending organisation - use the send organisation's ODS site code -->
		<itk:auditIdentity>
			<itk:id uri="urn:nhs-uk:identity:ods:5L399"/>
		</itk:auditIdentity>
		<!-- for 111 CDA documents (to A&E; GP; OOH etc.) there should only be 1 CDA document per transmission, so manifest should only have 1 item -->
		<itk:manifest count="1">
			<!-- CDA documents have a mimetype of application/cda+xml. id is the id of the CDA payload (<payload@id>) -->
			<!-- for more details of manifest attributes see the ITK Core pack -->
			<itk:manifestitem mimetype="text/xml" id="uuid_7D6F23E0-AE1A-11DB-9808-B18E1E0994EE" profileid="urn:nhs-en:profile:nhs111CDADocument-v2-0"/>
		</itk:manifest>
		<!-- the sender address - use the ODS org site code of the sender, with a SDS idenifier of the sending person if available -->
		<itk:senderAddress uri="urn:nhs-uk:addressing:ods:5L399:445510770"/>
		<!-- handlingSpecification contains the interaction id from the 111 specification - key is always fixed; value varies depending on recipient -->
		<itk:handlingSpecification>
			<itk:spec value="urn:nhs-itk:interaction:primaryOutofHourRecipientNHS111CDADocument-v2-0" key="urn:nhs-itk:ns:201005:interaction"/>
		</itk:handlingSpecification>
	</itk:header>
	<itk:payloads count="1">
		<!-- this matches the manifestitem@id for the payload being referenced by the manifest -->
		<itk:payload id="uuid_7D6F23E0-AE1A-11DB-9808-B18E1E0994EE">
			<!-- the document goes here --><ClinicalDocument xmlns="urn:hl7-org:v3" xmlns:ns2="NPFIT:HL7:Localisation">
        <code codeSystem="2.16.840.1.113883.2.1.3.2.4.15" code="1066271000000101"/>
        <confidentialityCode displayName="very restricted" codeSystem="2.16.840.1.113883.1.11.16926" code="V"/>
        <effectiveTime value="2019-04-04 09:17:20.372"/>
        <id/>
        <ns2:messageType extension="POCD_MT200001GB02" root="2.16.840.1.113883.2.1.3.2.4.18.17"/>
        <setId/>
        <title>
            <reference value="Integrated Urgent Care Report"/>
        </title>
        <versionNumber value="1"/>
        <author typeCode="AUT">
            <ns2:contentId extension="COCD_TP145200GB01#AssignedAuthor" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
            <functionCode displayName="Originating Author" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.178" code="OA"/>
            <time value="2019-04-04 09:17:20.369"/>
            <COCD_TP145200GB01.AssignedAuthor classCode="ASSIGNED">
                <addr xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                <code displayName="Call Operator" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.124" code="NR1690"/>
                <templateId extension="COCD_TP145200GB01#AssignedAuthor" root="2.16.840.1.113883.2.1.3.2.4.18.2"/>
                <assignedPerson determinerCode="INSTANCE" classCode="PSN">
                    <name use="L">
                        Jim Bob Walton, Jr
                    </name>
                    <templateId extension="COCD_TP145200GB01#assignedPerson" root="2.16.840.1.113883.2.1.3.2.4.18.2"/>
                </assignedPerson>
                <representedOrganization determinerCode="INSTANCE" classCode="ORG">
                    <id extension="EMS01" root="2.16.840.1.113883.2.1.3.2.4.19.2 "/>
                    <name use="L">
                        EMS Test Harness
                    </name>
                    <templateId extension="COCD_TP145200GB01#representedOrganization" root="2.16.840.1.113883.2.1.3.2.4.18.2"/>
                </representedOrganization>
            </COCD_TP145200GB01.AssignedAuthor>
        </author>
        <authorization typeCode="AUTH">
            <ns2:contentId extension="COCD_TP146226GB02#Consent" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
        </authorization>
        <component contextConductionInd="true" typeCode="COMP">
            <structuredBody moodCode="EVN" classCode="DOCBODY">
                <component contextConductionInd="false" typeCode="COMP">
                    <classificationSection moodCode="EVN" classCode="DOCSECT">
                        <component contextConductionInd="false" typeCode="COMP">
                            <COCD_TP146246GB01.Section1 moodCode="EVN" classCode="DOCSECT">
                                <text>
                                    All okay
                                </text>
                                <title>
                                    <titletest xmlns="" xmlns:ns3="urn:hl7-org:v3">
                                        testTextContent
                                    </titletest>
                                </title>
                            </COCD_TP146246GB01.Section1>
                        </component>
                        <entry contextConductionInd="false" typeCode="COMP">
                            <COCD_TP146092GB01.ClinicalDiscriminator moodCode="EVN" classCode="OBS">
                                <value code="cardio"/>
                            </COCD_TP146092GB01.ClinicalDiscriminator>
                        </entry>
                        <entry contextConductionInd="false" typeCode="COMP">
                            <COCD_TP146092GB01.ClinicalDiscriminator moodCode="EVN" classCode="OBS">
                                <value displayName="Chief concern: Palpitations "/>
                            </COCD_TP146092GB01.ClinicalDiscriminator>
                        </entry>
                        <entry contextConductionInd="false" typeCode="COMP">
                            <COCD_TP146092GB01.ClinicalDiscriminator moodCode="EVN" classCode="OBS">
                                <value/>
                            </COCD_TP146092GB01.ClinicalDiscriminator>
                        </entry>
                        <entry contextConductionInd="false" typeCode="COMP">
                            <COCD_TP146092GB01.ClinicalDiscriminator moodCode="EVN" classCode="OBS">
                                <value displayName="Chief concern: Palpitations "/>
                            </COCD_TP146092GB01.ClinicalDiscriminator>
                        </entry>
                    </classificationSection>
                </component>
            </structuredBody>
        </component>
        <documentationOf typeCode="DOC">
            <ns2:contentId extension="COCD_TP146227GB02#ServiceEvent" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
            <COCD_TP146227GB02.ServiceEvent moodCode="EVN"/>
        </documentationOf>
        <informant contextControlCode="OP" typeCode="INF">
            <ns2:contentId extension="COCD_TP145210GB01#AssignedEntity" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
            <COCD_TP145210GB01.AssignedEntity classCode="ASSIGNED"/>
        </informant>
        <informationRecipient typeCode="PRCP">
            <ns2:contentId extension="COCD_TP145202GB02#IntendedRecipient" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
            <COCD_TP145202GB02.IntendedRecipient classCode="ASSIGNED">
                <assignedPerson determinerCode="INSTANCE" classCode="PSN">
                    <name use="L">
                        John Blog Dr
                    </name>
                </assignedPerson>
            </COCD_TP145202GB02.IntendedRecipient>
        </informationRecipient>
        <participant xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <recordTarget contextControlCode="OP" typeCode="RCT">
            <ns2:contentId extension="COCD_TP145201GB01#PatientRole" root="2.16.840.1.113883.2.1.3.2.4.18.16"/>
            <COCD_TP145201GB01.PatientRole classCode="PAT">
                <patientPatient determinerCode="INSTANCE" classCode="PSN">
                    <administrativeGenderCode displayName="Female" codeSystem="http://hl7.org/fhir/administrative-gender" code="Female"/>
                    <birthTime value="Wed Sep 07 00:00:00 BST 2011"/>
                    <name use="L">
                        Joanne Bloggs
                    </name>
                </patientPatient>
            </COCD_TP145201GB01.PatientRole>
        </recordTarget>
        <tracker xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
    </ClinicalDocument><!-- the document ends here -->		
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>