TKW/contrib/ITK_2_01_Test_Messages/111/Repeat_Caller_Resp_IIQ_nodoc_PRPA_EX000001GB01_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--This example message is provided for illustrative purposes only. It has had no clinical validation. Whilst every effort has been taken to ensure that the examples are consistent with the message specification contained within the MiM, where there are conflicts with the written message specification or schema, the specification or schema shall be considered to take precedence-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0Response</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<wsa:From>
			<wsa:Address>http://localhost:4000</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
<itk:DistributionEnvelope xmlns:itk="urn:nhs-itk:ns:201005" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<!-- the header of the distribution envelope contains a service name - ALWAYS "NHS111RepeatCallerSyncQueryResp-v1-0" for NHS 111 CDA documents and a generated DCE UUID trackingId-->
	<itk:header service="urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0Response" trackingid="7D6F23E0-AE1A-11DB-9808-B18E1E0994AA">
		<!-- the address list is not needed, as the end point has been looked up and is in the SOAP header 
		<itk:addresslist>
			<itk:address uri="urn:nhs-uk:addressing:ods:RepeatCallerEndPoint"/>
		</itk:addresslist> -->
		<!-- an audit identification of the sending organisation - use the send organisation's ODS site code -->
		<itk:auditIdentity>
			<itk:id uri="urn:nhs-uk:identity:ods:5L399"/>
		</itk:auditIdentity>
		<!-- for 111 Repeat caller query, only 1 payload is expected -->
		<itk:manifest count="1">
			<!-- mimetype will be text/xml -->
			<!--profileid will be as shown-->
			<!--id is a generated DCE UUID prefixed with "uuid_"-->
			<!-- for more details of manifest attributes see the ITK Core pack -->
			<itk:manifestitem mimetype="text/xml" id="uuid_7D6F23E0-AE1A-11DB-9808-B18E1E0994BB" profileid="urn:nhs-en:profile:nhs111RepeatCallerResponse-v1-0"/>
		</itk:manifest>
		<!-- the sender address - use the ODS org site code of the requester, with a SDS idenifier of the requesting person if available -->
		<itk:senderAddress uri="urn:nhs-uk:addressing:ods:5L399:445510770"/>
		<!-- handlingSpecification contains the interaction id from the 111 specification - key & value are as shown -->
		<itk:handlingSpecification>
			<itk:spec value="urn:nhs-itk:interaction:nhs111RepeatCallerSyncQueryResp-v1-0" key="urn:nhs-itk:ns:201005:interaction"/>
		</itk:handlingSpecification>
	</itk:header>
	<itk:payloads count="1">
		<!-- this matches the manifestitem@id for the payload being referenced by the manifest -->
		<itk:payload id="uuid_7D6F23E0-AE1A-11DB-9808-B18E1E0994BB">
		
			<!--the repeat caller request goes in here-->
			<RepeatCallerResponse classCode="OBS" moodCode="EVN" xmlns:npfitlc="NPFIT:HL7:Localisation" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">
	<!--for a repeat caller response, the code will always be fixed as shown-->
	<code code="02" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.420"/>
	<!--the time that the response was made-->
	<effectiveTime value="201202120955"/>
	<!--a DCE UUID identification for the response-->
	<id root="7D6F23E0-AE1A-11DB-980C-B18E1E0994CD"/>
	<!--the tyrp of response. Shown here is a potential repeat caller response. The types of response are
		RC - Repeat Caller - the database has matched the patient and one or more CDA documents will be retuened
		NRC - Not Repeat Caller - the database has been unable to match the patient's details
		PRC - Potential Repeat Caller - the database has match more than one patient with the information given
		IIQ - Insufficient Information for Query - the requester has provided too little information
		ER - Repeat Caller Service Error - the repeat caller service has experienced a problem and cannot respond with on eof the above codes-->
	<value code="IIQ" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.421" displayName="Insufficient Information for Query"/>
	<!--the author of the response - which will always be the repeat caller service-->
	<!--typeCode and contextControlCode are always fixed as shown-->
	<author typeCode="AUT" contextControlCode="OP">
		<!--as there is only one template for a response author, the contentId is effectively fixed as shown-->
		<npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145208GB01#AssignedAuthor"/>
		<!--classCode always fixed as shown-->
		<COCD_TP145208GB01.AssignedAuthor classCode="ASSIGNED">
			<!--code will be fixed to NA as shown-->
			<code nullFlavor="NA"/>
			<!--id wil be fixed to NA as shown-->
			<id nullFlavor="NA"/>
			<!--templateId is always fixed as shown-->
			<templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145208GB01#AssignedAuthor"/>
			<!--classCode and determinerCode are fixed as shown-->
			<representedOrganization classCode="ORG" determinerCode="INSTANCE">
				<!--id should be the organisation identifier for the Repeat Caller Service - I don't know what the code for the repeat caller service is-->
				<id root="2.16.840.1.113883.2.1.3.2.4.19.1" extension="UNKNOWNCODE"/>
				<!--the name of the repeat caller service organisation (unknown for now)-->
				<name>NHS111 Repeat Caller Service</name>
				<!--templateId is always fixed as shown-->
				<templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145208GB01#representedOrganization"/>
			</representedOrganization>
		</COCD_TP145208GB01.AssignedAuthor>
	</author>
	<!--typeCode and contextControlCode are always fixed as shown-->
	<primaryInformationRecipient typeCode="PRCP" contextControlCode="OP">
		<!--as there is only one template for recipient, its effectively fixed as shown-->
		<npfitlc:contentId root="2.16.840.1.113883.2.1.3.2.4.18.16" extension="COCD_TP145202GB02#IntendedRecipient"/>
		<!--classCode is always fixed as shown-->
		<COCD_TP145202GB02.IntendedRecipient classCode="ASSIGNED">
			<!--an optional address of the recipient-->
			<addr>
				<streetAddressLine>Birming NHS111 Call Centre</streetAddressLine>
				<streetAddressLine>5 New Street</streetAddressLine>
				<streetAddressLine>Birmingham</streetAddressLine>
				<postalCode>B1 4HY</postalCode>	
			</addr>
			<!--id is to do with roles of the recipient - not relevant, so use nullflavor as shown-->
			<id nullFlavor="NA"/>
			<!--an optional recipient role code-->
			<npfitlc:recipientRoleCode code="584H" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.339" displayName="Senior Call Handler"/>
			<!--an optional telecom for the recipient-->
			<telecom value="tel:01256789033" use="EC"/>
			<!--templateId is always fixed as shown-->
			<templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145202GB02#IntendedRecipient"/>
			<!--person details for the recipient. classCode and determinerCode are always fixed as shown-->
			<assignedPerson classCode="PSN" determinerCode="INSTANCE">
				<!--name of the recipient-->
				<name>
					<given>Harry</given>
					<family>Smith</family>				
				</name>
				<!--templateId is always fixed as shown-->
				<templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145202GB02#assignedPerson"/>
			</assignedPerson>
			<!--classCode and determinerCode are always fixed as shown-->
			<representedOrganization classCode="ORG" determinerCode="INSTANCE">
				<!--the recipient orgnisation(site) details-->
				<id root="2.16.840.1.113883.2.1.3.2.4.19.2" extension="45TTH"/>
				<!--the name associated with the above code-->
				<name>Birmingham NHS111 Call Centre</name>
				<!--standardIndustryClassCode is optional and irrelevant, so not used
				<standardIndustryClassCode code="" codeSystem="" displayName=""/>-->
				<!--templateId is always fixed as shown-->
				<templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145202GB02#representedOrganization"/>
			</representedOrganization>
		</COCD_TP145202GB02.IntendedRecipient>
	</primaryInformationRecipient>
	<!--typeCode and contextConductionInd are always fixed as shown-->
	<reference typeCode="REFR" contextConductionInd="false">
		<!--seperatableId always fixed as shown-->
		<seperatableInd value="false"/>
		<!--classCode and moodCode are always fixed as shown-->
		<referredToRequest classCode="CACT" moodCode="EVN">
			<!--the identifier of the query that caused this response-->
			<id root="7D6D9D40-AE1A-11DB-9803-B18E1E0994CD"/>
		</referredToRequest>
	</reference>
	<!--as this is a potential match, no documents are returned
	<subject>
		<ClinicalDocument>
		
		</ClinicalDocument>
	</subject> -->
</RepeatCallerResponse>
		</itk:payload>
	</itk:payloads>
</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>